<a href="https://colab.research.google.com/github/ARKA1112/Python-practice-projects/blob/main/faa_fatal_accidents.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

In [14]:
studen_score_math =  pd.DataFrame({'Name':['Tom','Adam', 'Paul', 'David', 'Amber'],
                                   'ID':[70,40,60,55,32]})
print(studen_score_math)

    Name  ID
0    Tom  70
1   Adam  40
2   Paul  60
3  David  55
4  Amber  32

In [15]:
studen_score_science = pd.DataFrame({'Name':['Adam','David','Sharon'],
                                     'ID':[40,55,11]})
print(studen_score_science)

     Name  ID
0    Adam  40
1   David  55
2  Sharon  11

In [17]:
studen_score_science_math = pd.merge(studen_score_math,studen_score_science)

In [18]:
print(studen_score_science_math )

    Name  ID
0   Adam  40
1  David  55

In [21]:
left_merge = pd.merge(studen_score_math,studen_score_science, on ='ID', how = 'left').fillna('x')
print(left_merge)

  Name_x  ID Name_y
0    Tom  70      x
1   Adam  40   Adam
2   Paul  60      x
3  David  55  David
4  Amber  32      x

In [24]:
concat = pd.concat([studen_score_math,studen_score_science])

In [25]:
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],
                                       'ID':[10,56,10,85,9,56]})

In [26]:
df_student_survey_data

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [27]:
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [30]:
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [31]:
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [32]:
import sqlite3

In [33]:
create_table = """CREATE TABLE student_score
(ID INT, Name VARCHAR(20), Math REAL, Science REAL);"""

In [35]:
print(create_table)

CREATE TABLE student_score
(ID INT, Name VARCHAR(20), Math REAL, Science REAL);

In [36]:
executeSQL = sqlite3.connect(':memory')
executeSQL.execute(create_table)
executeSQL.commit()

In [37]:
SQL_query = executeSQL.execute('select * from student_score')

In [38]:
resulset =SQL_query.fetchall()

In [39]:
resulset

[]

In [40]:
insertSQL = [(10,'Jack',85,92),
             (29,'Tom',73,89),
             (65,'Ram', 65.5, 77),
             (5, 'Steve',55,91)
             ]

In [43]:
insert_statement = 'Insert into student_score values(?,?,?,?)'
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

In [44]:
#prepare SQL query
SQL_query = executeSQL.execute('select * from student_score')

In [45]:
resulset = SQL_query.fetchall()

In [46]:
resulset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [98]:
faa = pd.read_csv('/content/faa_ai_prelim.csv')

In [ ]:
faa.isna()

In [59]:
faa.columns

Index(['UPDATED', 'ENTRY_DATE', 'EVENT_LCL_DATE', 'EVENT_LCL_TIME',
       'LOC_CITY_NAME', 'LOC_STATE_NAME', 'LOC_CNTRY_NAME', 'RMK_TEXT',
       'EVENT_TYPE_DESC', 'FSDO_DESC', 'REGIST_NBR', 'FLT_NBR', 'ACFT_OPRTR',
       'ACFT_MAKE_NAME', 'ACFT_MODEL_NAME', 'ACFT_MISSING_FLAG',
       'ACFT_DMG_DESC', 'FLT_ACTIVITY', 'FLT_PHASE', 'FAR_PART', 'MAX_INJ_LVL',
       'FATAL_FLAG', 'FLT_CRW_INJ_NONE', 'FLT_CRW_INJ_MINOR',
       'FLT_CRW_INJ_SERIOUS', 'FLT_CRW_INJ_FATAL', 'FLT_CRW_INJ_UNK',
       'CBN_CRW_INJ_NONE', 'CBN_CRW_INJ_MINOR', 'CBN_CRW_INJ_SERIOUS',
       'CBN_CRW_INJ_FATAL', 'CBN_CRW_INJ_UNK', 'PAX_INJ_NONE', 'PAX_INJ_MINOR',
       'PAX_INJ_SERIOUS', 'PAX_INJ_FATAL', 'PAX_INJ_UNK', 'GRND_INJ_NONE',
       'GRND_INJ_MINOR', 'GRND_INJ_SERIOUS', 'GRND_INJ_FATAL', 'GRND_INJ_UNK'],
      dtype='object')

In [107]:
df_faa = faa[['ACFT_MAKE_NAME','LOC_STATE_NAME','ACFT_MODEL_NAME','RMK_TEXT','FLT_PHASE',
             'EVENT_TYPE_DESC','FATAL_FLAG']]

In [100]:
df_faa.shape

(83, 7)

In [ ]:
df_faa.isna()

In [108]:
df_faa['FATAL_FLAG'].fillna(value = 'No',inplace = True)

/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:4536: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  downcast=downcast,

In [109]:
df_faa

    ACFT_MAKE_NAME  LOC_STATE_NAME  ... EVENT_TYPE_DESC FATAL_FLAG
0            BEECH  North Carolina  ...        Accident        Yes
1             VANS         Florida  ...        Incident         No
2           CESSNA      New Jersey  ...        Incident         No
3          LANCAIR  North Carolina  ...        Incident         No
4           CESSNA          Alaska  ...        Incident         No
..             ...             ...  ...             ...        ...
78         AERONCA           Texas  ...        Accident         No
79  NORTH AMERICAN         Arizona  ...        Accident        Yes
80        CHAMPION      California  ...        Accident        Yes
81           BEECH      California  ...        Accident        Yes
82          CESSNA         Alabama  ...        Accident        Yes

[83 rows x 7 columns]

In [110]:
df_faa.shape

(83, 7)

In [111]:
acft_type = df_faa.groupby('ACFT_MAKE_NAME')

In [112]:
print(acft_type)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7faccc27ecd0>

In [113]:
acft_type.size()

ACFT_MAKE_NAME
AERO COMMANDER             1
AERONCA                    1
AEROSTAR INTERNATIONAL     1
AIRBUS                     1
BEECH                      9
BELL                       2
BOEING                     3
CESSNA                    23
CHAMPION                   2
CHRISTEN                   1
CONSOLIDATED VULTEE        1
EMBRAER                    1
ENSTROM                    1
FAIRCHILD                  1
FLIGHT DESIGN              1
GLOBE                      1
GREAT LAKES                1
GRUMMAN                    1
GULFSTREAM                 1
HUGHES                     1
LANCAIR                    2
MAULE                      1
MOONEY                     4
NORTH AMERICAN             1
PIPER                     10
PITTS                      1
SAAB                       1
SABRELINER                 1
SOCATA                     2
VANS                       1
dtype: int64

In [116]:
df_faa = df_faa.dropna(subset = ['ACFT_MAKE_NAME'])

In [118]:
df_faa.shape

(78, 7)

In [121]:
GRP = df_faa.groupby('FATAL_FLAG')

In [124]:
GRP.size()

FATAL_FLAG
No     71
Yes     7
dtype: int64

In [129]:
fatal_accidents = GRP.get_group('Yes')

In [130]:
fatal_accidents

    ACFT_MAKE_NAME  LOC_STATE_NAME  ... EVENT_TYPE_DESC FATAL_FLAG
0            BEECH  North Carolina  ...        Accident        Yes
53           PIPER         Florida  ...        Accident        Yes
55   FLIGHT DESIGN      California  ...        Accident        Yes
79  NORTH AMERICAN         Arizona  ...        Accident        Yes
80        CHAMPION      California  ...        Accident        Yes
81           BEECH      California  ...        Accident        Yes
82          CESSNA         Alabama  ...        Accident        Yes

[7 rows x 7 columns]